//
//  AllRefsPerDayHolder.swift
//  Bible Reading
//
//  Created by Anton Ivanov on 04.01.17.
//  Copyright © 2017 Anton Ivanov. All rights reserved.
//

import Foundation

class AllRefsPerDayHolder {
    static public func findForCurrentDate() -> String? {
        return findForDay(date: Date())
    }
    
    static public func findForDay(date: Date) -> String? {
        let cal = Calendar.current
        let year = cal.component(Calendar.Component.year, from: date)
        if year != 2017 {
            return nil
        }
        let day = cal.ordinality(of: .day, in: .year, for: date)
        return day.flatMap { (day) -> String? in
            refs2107[day - 1]
        }
    }
    
    static public let refs2107 = [
        "Числ 6,22-27;Пс 67, 2-3.5.6.8;Гал 4,4-7;Лк 2,16-21", // 1 января
        "1 Ин 2,22-28; Пс 98,1.2-4;Ин 1,19-28",
        "1 Ин 2,29-3,6;Пс 98,1.3-6; Ин 1,29-34",
        "1 Ин 3,7-10;Пс 98, 1.7-8.9;Ин 1,35-42",
        "1 Ин 3, 11-21;Пс 100,1-2.3.4.5;Ин 1,43-51",
        "Ис 60,1-6;Пс 72,1-13;Еф 3,2-3.5-6;Мф 2,1-12",
        "1 Ин 3,22-4,6;Пс 2,7-8.10-11;Мф 4,12-17.23-25",
        "Ис 42,1-4.6-7;Пс 29,1-2.3-4.9-10;Деян 10,34-38;Мф 3,13-17",
        "Евр 1,1-6;Пс 97,1-2.6-7;Мк 1,14-20",
        "Евр 2,5-12;Пс 8,2.5-9;Мк 1,21-28",
        
        "Евр 2,14-18;Пс 105, 1-9;Мк 1,29-39", // 11 января
        "Евр 3,7-14;Пс 95,6-11;Мк 1,40-45",
        "Евр 4,1-5.11;Пс 78,3-4.6-8;Мк 2,1-12",
        "Евр 4,12-16;Пс 19,8-10.15;Мк 2,13-17",
        "Ис 49,3.5-6;Пс 40,2.4.7-10;1 Кор 1,1-3;Ин 1,29-34",
        "Евр 5,1-10;Пс 110,1-4;Мк 2,18-22",
        "Евр 6,10-20;Пс 111,1-2.4-5.9-10;Мк 2,23-28",
        "Евр 7,1-3.15-17;Пс 110, 1-4;Мк 3,1-6",
        "Евр 7,25-8,6;Пс 40,7-10.17;Мк 3,7-12",
        "Евр 8,6-13;Пс 85,8.10-14;Мк 3,13-19",
        
        "Евр 9,2-3.11-14;Пс 47,2-3.6-9;Мк 3,20-21", // 21 января
        "Ис 8,23-9,3;Пс 27,1.4.13-14;1 Кор 1,10-13.17;Мф 4,12-23",
        "Евр 9,15.24-28;Пс 98,1-6;Мк 3,22-30",
        "Евр 10,1-10;Пс 40,2-4.7-8.10-11;Мк 3,31-35",
        "Деян 22,3-16;Пс 117,1.2;Мк 16,15-18",
        "2 Тим 1,1-8;Пс 96,1-3.7-8.10;Лк 10,1-9",
        "Евр 10,32-39;Пс 37,3-6.23-24.39-40;Мк 4,26-34",
        "Евр 11,1-2.8-19;Мк 4,35-41",
        "Соф 2,3.3,12-13;Пс 146,6-10;1 Кор 1,26-31;Мф 5,1-12",
        "Евр 11,32-40;Пс 31,20-24;Мк 5,1-20",
        "Евр 12,1-4;Пс 22,26-28.30-32;Мк 5,21-43",
        
        "", // 1 февраля
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        
        "", // 11 февраля
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",

        "", // 21 февраля
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
]
}
